## Задание 11

В accounts.*.csv найти id, для которого в столбце amount встречается наибольшее количество значений, кратных трем.<br>
Выполнить задание с использованием Dask (корректным!), распараллелив процесс обработки данных (использование Dask должно приводить к истинной параллельной обработке данных)

In [1]:
import pandas as pd
import numpy as np
import dask.dataframe as dd

In [2]:
accounts = dd.read_csv("./data/accounts.*.csv")

In [3]:
accounts.head()

    id   names  amount
0  187  Ingrid     457
1  346  Ursula     747
2  350     Dan    1175
3  464   Zelda    -571
4  431   Wendy    4534

In [4]:
accounts.tail()

         id    names  amount
999995   43      Dan     933
999996  431    Wendy    4913
999997  168   Hannah     323
999998  308  Norbert     -14
999999  353   Ingrid     366

In [7]:
result = (accounts["amount"] % 3 == 0).groupby(accounts["id"]).sum().argmax().compute()
result

AttributeError: 'Series' object has no attribute 'argmax'

In [ ]:
accounts.iloc[:, id]